tests/cases/gateFreeze/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\  /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Velocity: the upper wall moves at 1 m/s, all other walls are fixed;
    the side walls are slip so the profile is one-dimensional.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
80
(
(0.025 0 0)
(0.025 0 0)
(0.025 0 0)
(0.025 0 0)
(0.075 0 0)
(0.075 0 0)
(0.075 0 0)
(0.075 0 0)
...
)
;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    bottom
    {
        type            noSlip;
    }

    top
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    left
    {
        type            cyclic;
    }

    right
    {
        type            cyclic;
    }
}

// ************************************************************************* //
